/**
 * Jingga
 *
 * @copyright Jingga
 * @license   OMS License 2.0
 * @version   1.0.0
 * @link      https://jingga.app
 */
#ifndef COMS_MEMORY_CHUNK_MEMORY_H
#define COMS_MEMORY_CHUNK_MEMORY_H

#include "../stdlib/Stdlib.h"
#include "../utils/Assert.h"
#include "../utils/BitUtils.h"
#include "../compiler/CompilerUtils.h"
#include "../log/Log.h"
#include "../log/Stats.h"
#include "../log/PerformanceProfiler.h"
#include "../log/DebugMemory.h"
#include "../thread/ThreadDefines.h"
#include "BufferMemory.h"
#include "../system/Allocator.h"

/**
 * This storage system is best used for fixed sized chunks
 * What I mean by that, every element has the same size.
 * Currently a caller could reserve multiple chunks to represent a single data entity
 * This can be fine in a single threaded application
 * However, this can lead to fragmentation which is hard to clean up because
 * we can't just defragment the memory since we don't know which chunks are currently in use
 * In use could mean by pointer of id. In use data isn't allowed to move or it would become "invalid"
 * If you need a data structure that can be defragmented use DataPool, which basically builds upon ChunkMemory
 * Fixed sized data structures that use this ChunkMemory can be:
 *      1. HashMap
 *      2. Queue
 * Carefull, both examples have alternative use cases which may require variable sized elements
 * WARNING: Changing this struct has effects on other data structures
 */
// @performance Are we losing a lot of performance by using atomic_ (= volatile) in single threaded use cases
struct ChunkMemory {
    byte* memory;

    // @question Do I really want to use uint?
    uint_max size;
    atomic_32 int32 last_pos;
    uint32 capacity;
    int32 chunk_size;

    // WARNING: The alignment may increase the original chunk size e.g.
    // element_size = 14, alignment = sizeof(size_t) => chunk_size = 32
    uint32 alignment;

    // length = count
    // free describes which locations are used and which are free
    atomic_ptr uint_max* free;

    // Chunk implementation ends here
    // The completeness indicates if the data is completely written to
    atomic_ptr uint_max* completeness;

    mutex lock;
};

FORCE_INLINE
int32 chunk_size_element(int32 element_size, int32 alignment = sizeof(size_t)) NO_EXCEPT
{
    return align_up(element_size, alignment);
}

FORCE_INLINE
uint_max chunk_size_total(uint32 capacity, int32 element_size, int32 alignment = sizeof(size_t)) NO_EXCEPT
{
    element_size = chunk_size_element(element_size, alignment);

    // @performance Can we remove the alignment * 2? This is just a shotgun method to ensure full alignment

    return capacity * element_size
        + sizeof(uint_max) * ceil_div(capacity, (uint32) (sizeof(uint_max) * 8)) // free
        + alignment * 2; // overhead for alignment
}

FORCE_INLINE
uint_max thrd_chunk_size_total(uint32 capacity, int32 element_size, int32 alignment = sizeof(size_t)) NO_EXCEPT
{
    element_size = chunk_size_element(element_size, alignment);

    // @performance Can we remove the alignment * 2? This is just a shotgun method to ensure full alignment

    const size_t array_count = ceil_div(capacity, (uint32) (sizeof(uint_max) * 8));

    return capacity * element_size
        + sizeof(uint_max) * array_count // free
        + sizeof(uint_max) * array_count // completeness
        + alignment * 2; // overhead for alignment
}

// INFO: A chunk count of 2^n is recommended for maximum performance
// @performance Do we maybe want to define both the element alignment and memory start alignment (e.g. 64 byte = cache line alignment for the memory)
inline
void chunk_alloc(ChunkMemory* const buf, uint32 capacity, int32 element_size, int32 alignment = sizeof(size_t)) NO_EXCEPT
{
    PROFILE(PROFILE_CHUNK_ALLOC, NULL, PROFILE_FLAG_SHOULD_LOG);
    ASSERT_TRUE(element_size);
    ASSERT_TRUE(capacity);
    ASSERT_TRUE(alignment % sizeof(int) == 0);

    LOG_1("[INFO] Allocating ChunkMemory");

    element_size = chunk_size_element(element_size, alignment);
    const uint_max size = chunk_size_total(capacity, element_size, alignment);

    buf->memory = alignment < 2
        ? (byte *) platform_alloc(size)
        : (byte *) platform_alloc_aligned(size, size, alignment);

    // @question Why don't I memset the memory to 0 here, but do it in chunk_init

    buf->capacity = capacity;
    buf->size = size;
    buf->chunk_size = element_size;
    buf->last_pos = -1;
    buf->alignment = alignment;
    buf->free = (uint_max *) align_up(
        (uint_max) ((uintptr_t) (buf->memory + capacity * element_size)),
        (uint_max) alignment
    );
    memset((void *) buf->free, 0, sizeof(uint_max) * ceil_div(capacity, (uint32) (sizeof(uint_max) * 8)));

    LOG_1("[INFO] Allocated ChunkMemory: %n B", {DATA_TYPE_UINT64, &buf->size});
}

inline
void thrd_chunk_alloc(ChunkMemory* const buf, uint32 capacity, int32 element_size, int32 alignment = 32)
{
    ASSERT_TRUE(element_size);
    ASSERT_TRUE(capacity);
    ASSERT_TRUE(alignment % sizeof(int) == 0);

    PROFILE(PROFILE_CHUNK_ALLOC, NULL, PROFILE_FLAG_SHOULD_LOG);
    LOG_1("[INFO] Allocating ChunkMemory");

    element_size = chunk_size_element(element_size, alignment);
    const uint_max size = thrd_chunk_size_total(capacity, element_size, alignment);

    buf->memory = alignment < 2
        ? (byte *) platform_alloc(size)
        : (byte *) platform_alloc_aligned(size, size, alignment);

    buf->capacity = capacity;
    buf->size = size;
    buf->chunk_size = element_size;
    buf->last_pos = -1;
    buf->alignment = alignment;

    const size_t array_count = ceil_div(capacity, (uint32) (sizeof(uint_max) * 8));

    // @question Could it be beneficial to have this before the element data?
    buf->free = (uint_max *) align_up((uintptr_t) (buf->memory + capacity * element_size), alignment);
    buf->completeness = (uint_max *) align_up((uintptr_t) (buf->free + array_count), alignment);

    memset((void *) buf->free, 0, sizeof(uint_max) * array_count);
    memset((void *) buf->completeness, 0, sizeof(uint_max) * array_count);

    mutex_init(&buf->lock, NULL);

    LOG_1("[INFO] Allocated ChunkMemory: %n B", {DATA_TYPE_UINT64, &buf->size});
}

inline
void chunk_init(
    ChunkMemory* const buf,
    BufferMemory* const data,
    uint32 capacity,
    int32 element_size,
    int32 alignment = sizeof(size_t)
) NO_EXCEPT
{
    ASSERT_TRUE(element_size);
    ASSERT_TRUE(capacity);
    ASSERT_TRUE(alignment % sizeof(int) == 0);

    element_size = chunk_size_element(element_size, alignment);

    const uint_max size = chunk_size_total(capacity, element_size, alignment);

    buf->memory = buffer_get_memory(data, size, alignment);
    memset(buf->memory, 0, size);

    buf->capacity = capacity;
    buf->size = size;
    buf->chunk_size = element_size;
    buf->last_pos = -1;
    buf->alignment = alignment;
    buf->free = (uint_max *) align_up((uintptr_t) (buf->memory + capacity * element_size), (sizeof(uint_max) * 8));
    memset((void *) buf->free, 0, sizeof(uint_max) * ceil_div(capacity, (uint32) (sizeof(uint_max) * 8)));

    DEBUG_MEMORY_SUBREGION((uintptr_t) buf->memory, buf->size);
}

inline
void thrd_chunk_alloc(
    ChunkMemory* const buf,
    BufferMemory* const data,
    uint32 capacity,
    int32 element_size,
    int32 alignment = sizeof(size_t)
)
{
    ASSERT_TRUE(element_size);
    ASSERT_TRUE(capacity);
    ASSERT_TRUE(alignment % sizeof(int) == 0);

    LOG_1("[INFO] Allocating ChunkMemory");

    element_size = chunk_size_element(element_size, alignment);
    const uint_max size = thrd_chunk_size_total(capacity, element_size, alignment);

    buf->memory = buffer_get_memory(data, size);

    buf->capacity = capacity;
    buf->size = size;
    buf->chunk_size = element_size;
    buf->last_pos = -1;
    buf->alignment = alignment;

    const size_t array_count = ceil_div(capacity, (uint32) (sizeof(uint_max) * 8));

    // @question Could it be beneficial to have this before the element data?
    buf->free = (uint_max *) align_up((uintptr_t) (buf->memory + capacity * element_size), alignment);
    buf->completeness = (uint_max *) align_up((uintptr_t) (buf->free + array_count), alignment);

    memset((void *) buf->free, 0, sizeof(uint_max) * array_count);
    memset((void *) buf->completeness, 0, sizeof(uint_max) * array_count);

    mutex_init(&buf->lock, NULL);

    LOG_1("[INFO] Allocated ChunkMemory: %n B", {DATA_TYPE_UINT64, &buf->size});
}

inline
void chunk_init(
    ChunkMemory* const buf,
    byte* const data,
    uint32 capacity,
    int32 element_size,
    int32 alignment = sizeof(size_t)
) NO_EXCEPT
{
    ASSERT_TRUE(element_size);
    ASSERT_TRUE(capacity);
    ASSERT_TRUE(alignment % sizeof(int) == 0);

    element_size = chunk_size_element(element_size, alignment);

    const uint_max size = chunk_size_total(capacity, element_size, alignment);

    buf->memory = (byte *) align_up((uintptr_t) data, alignment);

    buf->capacity = capacity;
    buf->size = size;
    buf->chunk_size = element_size;
    buf->last_pos = -1;
    buf->alignment = alignment;
    buf->free = (uint_max *) align_up(
        (uintptr_t) (buf->memory + capacity * element_size),
        (uint_max) alignment
    );
    memset((void *) buf->free, 0, sizeof(uint_max) * ceil_div(capacity, (uint32) (sizeof(uint_max) * 8)));

    DEBUG_MEMORY_SUBREGION((uintptr_t) buf->memory, buf->size);
}

inline
void thrd_chunk_alloc(
    ChunkMemory* const buf,
    byte* const data,
    uint32 capacity,
    int32 element_size,
    int32 alignment = sizeof(size_t)
)
{
    ASSERT_TRUE(element_size);
    ASSERT_TRUE(capacity);
    ASSERT_TRUE(alignment % sizeof(int) == 0);

    LOG_1("[INFO] Allocating ChunkMemory");

    element_size = chunk_size_element(element_size, alignment);
    const uint_max size = thrd_chunk_size_total(capacity, element_size, alignment);

    buf->memory = data;

    buf->capacity = capacity;
    buf->size = size;
    buf->chunk_size = element_size;
    buf->last_pos = -1;
    buf->alignment = alignment;

    const size_t array_count = ceil_div(capacity, (uint32) (sizeof(uint_max) * 8));

    // @question Could it be beneficial to have this before the element data?
    buf->free = (uint_max *) align_up((uintptr_t) (buf->memory + capacity * element_size), alignment);
    buf->completeness = (uint_max *) align_up((uintptr_t) (buf->free + array_count), alignment);

    memset((void *) buf->free, 0, sizeof(uint_max) * array_count);
    memset((void *) buf->completeness, 0, sizeof(uint_max) * array_count);

    mutex_init(&buf->lock, NULL);

